iTower_20__GIS_Управление_пространственными_данными/src/Catalogs/гисПоказатели/гисПоказатели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гисПоказатели</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТипЗначения</name>
    <type>
      <types>EnumRef.гисПоказателиТипы</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочникИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СправочникВладелецЗначений</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЗнаков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.гисПоказателиПериодичность</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СлоиКарты</name>
    <attributes>
      <name>СлойКарты</name>
      <type>
        <types>CatalogRef.гисСлоиКарты</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсплывающееСообщение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонРасчета</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Детализация</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЦветаПоказателей</name>
    <attributes>
      <name>КлючСтрокиСлоиКарты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цвет</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеОт</name>
      <type>
        <types>Boolean</types>
        <types>Number</types>
        <types>CatalogRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

iTower_20__GIS_Управление_пространственными_данными/src/InformationRegisters/гисЗначенияПоказателейОбъектов/гисЗначенияПоказателейОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гисЗначенияПоказателейОбъектов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЗначениеЧисло</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеБулево</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеСправочник</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.гисОбъектыКарты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.гисПоказатели</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iTower_20__GIS_Управление_пространственными_данными/src/Enums/гисПоказателиТипы/гисПоказателиТипы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гисПоказателиТипы</name>
  <enumValues>
    <name>Число</name>
  </enumValues>
  <enumValues>
    <name>Булево</name>
  </enumValues>
  <enumValues>
    <name>Справочник</name>
  </enumValues>
</mdclass:Enum>

iTower_20__GIS_Управление_пространственными_данными/src/Catalogs/гисПоказатели/Forms/ФормаАвтозаполнениеНастройки/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Дата = Параметры.Дата;
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	
	ЦветНачала = Новый Цвет(255, 0, 0);
	Элементы.ВыбратьЦветНачала.ЦветФона = ЦветНачала;
	ЦветКонца = Новый Цвет(0, 255, 0);
	Элементы.ВыбратьЦветКонца.ЦветФона = ЦветКонца;
	
	Если Не Параметры.Показатель.ТипЗначения = Перечисления.гисПоказателиТипы.Число Тогда
		Элементы.ЗначениеМин.Видимость = Ложь;
		Элементы.ЗначениеМакс.Видимость = Ложь;
		Элементы.КоличествоГрадаций.Видимость = Ложь;
	Иначе
		ЗаполнитьМинМакс();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЗаполнитьМинМакс();
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьЦветНачала(Команда)
	ОткрытьФорму("ОбщаяФорма.гисФормаВыбораЦветаRGB", Новый Структура("Цвет", ЦветНачала), Элементы.ВыбратьЦветНачала, , , , 
		Новый ОписаниеОповещения("ВыбратьЦветНачалаЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЦветНачалаЗавершение(ВыбраннныйЦвет, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(ВыбраннныйЦвет) = Тип("Цвет") Тогда
		ЦветНачала = ВыбраннныйЦвет;
		Элементы.ВыбратьЦветНачала.ЦветФона = ВыбраннныйЦвет;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьЦветКонца(Команда)
	ОткрытьФорму("ОбщаяФорма.гисФормаВыбораЦветаRGB", Новый Структура("Цвет", ЦветКонца), Элементы.ВыбратьЦветКонца, , , , 
		Новый ОписаниеОповещения("ВыбратьЦветКонцаЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЦветКонцаЗавершение(ВыбраннныйЦвет, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(ВыбраннныйЦвет) = Тип("Цвет") Тогда
		ЦветКонца = ВыбраннныйЦвет;
		Элементы.ВыбратьЦветКонца.ЦветФона = ВыбраннныйЦвет;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрименитьИзменения(Команда)
	Если Элементы.КоличествоГрадаций.Видимость И Не ЗначениеЗаполнено(КоличествоГрадаций) Тогда
		ПоказатьПредупреждение(, "Не заполнено количество градаций!");
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.Закрыть(Новый Структура("ЗначениеМин,ЗначениеМакс,КоличествоГрадаций,ЦветНачала,ЦветКонца", ЗначениеМин, ЗначениеМакс, КоличествоГрадаций, ЦветНачала, ЦветКонца));
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьМинМакс()
	Если Параметры.Показатель.ТипЗначения <> Перечисления.гисПоказателиТипы.Число Тогда
		Возврат;
	КонецЕсли;
	
	СписокОбъектов = Справочники.гисСлоиКарты.ПолучитьСписокОбъектов(Параметры.СлойКарты);
	
	Запрос = Новый Запрос("ВЫБРАТЬ Минимум(ВЫРАЗИТЬ(ЗначениеЧисло КАК Число)) КАК Мин, Максимум(ВЫРАЗИТЬ(ЗначениеЧисло КАК Число)) КАК Макс ИЗ РегистрСведений.гисЗначенияПоказателейОбъектов.СрезПоследних(&ДатаСреза, Показатель = &Показатель И Объект В (&СписокОбъектов))");
	Запрос.УстановитьПараметр("ДатаСреза", Дата);
	Запрос.УстановитьПараметр("Показатель", Параметры.Показатель);
	Запрос.УстановитьПараметр("СписокОбъектов", СписокОбъектов);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗначениеМин = Выборка.Мин;
		ЗначениеМакс = Выборка.Макс;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
